_playerUID = getPlayerUID player;
_zeusmodule = [ 
    "76561199002226480", /// Фламберг
    "76561199042520076", /// Ермак
    "76561198361041147", /// Кириенко
    "76561198815605790", /// Струна
	"76561198338806858", /// Цикада
	"76561198984888750", /// Варден
	"76561198316727609", /// Doctor
	"76561198852035938", /// Капуста
	"76561199287760678", /// Шилов
	"76561199061768748", /// Штефан
	"76561199161998110", /// Штурман
	"76561198908535754", /// Князь
	"76561199220409257", /// Опасный
	"76561199147083582", /// Каскад
	"76561198335268399", /// Газон
	"76561198393672616", /// Псих
	"76561198055139490", ///  Бiйрактар
	"76561198889672820", /// Тачанка
	"76561199786409092", /// Барон
	"76561198886338374", /// Гном
	"76561198081660694", /// Юнга
	"76561199168589957", /// Артист
	"76561198823028360", /// Riddler
	"76561199215615244"  /// КотоV
];

if (!(_playerUID in _zeusmodule)) exitwith {};
if ((side player != civilian) && (_playerUID != "76561198432363921") && (_playerUID != "76561198284004882") && (_playerUID != "76561198216667587") && (_playerUID != "76561199287760678")) exitwith {};

_index = _zeusmodule find _playerUID;
_myName = format["NordAdmin%1", _index];

systemChat "Assigning ZEUS...";

[player, _myName] remoteExec ["Nord_fnc_assignPlayerZeus", 2];